apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_lpuart.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_lpuart.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_LPUART_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_LPUART_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* LPUART Register Offsets **************************************************/

#define S32K3XX_LPUART_VERID_OFFSET    (0x00) /* Version ID Register (VERID) */
#define S32K3XX_LPUART_PARAM_OFFSET    (0x04) /* Parameter Register (PARAM) */
#define S32K3XX_LPUART_GLOBAL_OFFSET   (0x08) /* LPUART Global Register (GLOBAL) */
#define S32K3XX_LPUART_PINCFG_OFFSET   (0x0c) /* LPUART Pin Configuration Register (PINCFG) */
#define S32K3XX_LPUART_BAUD_OFFSET     (0x10) /* LPUART Baud Rate Register (BAUD) */
#define S32K3XX_LPUART_STAT_OFFSET     (0x14) /* LPUART Status Register (STAT) */
#define S32K3XX_LPUART_CTRL_OFFSET     (0x18) /* LPUART Control Register (CTRL) */
#define S32K3XX_LPUART_DATA_OFFSET     (0x1c) /* LPUART Data Register (DATA) */
#define S32K3XX_LPUART_MATCH_OFFSET    (0x20) /* LPUART Match Address Register (MATCH) */
#define S32K3XX_LPUART_MODIR_OFFSET    (0x24) /* LPUART Modem IrDA Register (MODIR) */
#define S32K3XX_LPUART_FIFO_OFFSET     (0x28) /* LPUART FIFO Register (FIFO) */
#define S32K3XX_LPUART_WATER_OFFSET    (0x2c) /* LPUART Watermark Register (WATER) */
#define S32K3XX_LPUART_DATARO_OFFSET   (0x30) /* Data read-only Register (DATARO) */

/* LPUART Register Addresses ************************************************/

#define S32K3XX_LPUART0_VERID          (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART0_PARAM          (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART0_GLOBAL         (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART0_PINCFG         (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART0_BAUD           (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART0_STAT           (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART0_CTRL           (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART0_DATA           (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART0_MATCH          (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART0_MODIR          (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART0_FIFO           (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART0_WATER          (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART0_DATARO         (S32K3XX_LPUART0_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART1_VERID          (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART1_PARAM          (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART1_GLOBAL         (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART1_PINCFG         (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART1_BAUD           (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART1_STAT           (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART1_CTRL           (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART1_DATA           (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART1_MATCH          (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART1_MODIR          (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART1_FIFO           (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART1_WATER          (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART1_DATARO         (S32K3XX_LPUART1_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART2_VERID          (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART2_PARAM          (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART2_GLOBAL         (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART2_PINCFG         (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART2_BAUD           (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART2_STAT           (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART2_CTRL           (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART2_DATA           (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART2_MATCH          (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART2_MODIR          (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART2_FIFO           (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART2_WATER          (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART2_DATARO         (S32K3XX_LPUART2_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART3_VERID          (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART3_PARAM          (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART3_GLOBAL         (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART3_PINCFG         (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART3_BAUD           (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART3_STAT           (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART3_CTRL           (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART3_DATA           (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART3_MATCH          (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART3_MODIR          (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART3_FIFO           (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART3_WATER          (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART3_DATARO         (S32K3XX_LPUART3_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART4_VERID          (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART4_PARAM          (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART4_GLOBAL         (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART4_PINCFG         (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART4_BAUD           (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART4_STAT           (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART4_CTRL           (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART4_DATA           (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART4_MATCH          (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART4_MODIR          (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART4_FIFO           (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART4_WATER          (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART4_DATARO         (S32K3XX_LPUART4_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART5_VERID          (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART5_PARAM          (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART5_GLOBAL         (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART5_PINCFG         (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART5_BAUD           (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART5_STAT           (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART5_CTRL           (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART5_DATA           (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART5_MATCH          (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART5_MODIR          (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART5_FIFO           (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART5_WATER          (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART5_DATARO         (S32K3XX_LPUART5_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART6_VERID          (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART6_PARAM          (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART6_GLOBAL         (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART6_PINCFG         (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART6_BAUD           (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART6_STAT           (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART6_CTRL           (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART6_DATA           (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART6_MATCH          (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART6_MODIR          (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART6_FIFO           (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART6_WATER          (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART6_DATARO         (S32K3XX_LPUART6_BASE + S32K3XX_LPUART_DATARO_OFFSET)

