apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_lpuart.h
#define S32K3XX_LPUART7_VERID          (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART7_PARAM          (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART7_GLOBAL         (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART7_PINCFG         (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART7_BAUD           (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART7_STAT           (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART7_CTRL           (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART7_DATA           (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART7_MATCH          (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART7_MODIR          (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART7_FIFO           (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART7_WATER          (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART7_DATARO         (S32K3XX_LPUART7_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART8_VERID          (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART8_PARAM          (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART8_GLOBAL         (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART8_PINCFG         (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART8_BAUD           (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART8_STAT           (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART8_CTRL           (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART8_DATA           (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART8_MATCH          (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART8_MODIR          (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART8_FIFO           (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART8_WATER          (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART8_DATARO         (S32K3XX_LPUART8_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART9_VERID          (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART9_PARAM          (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART9_GLOBAL         (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART9_PINCFG         (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART9_BAUD           (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART9_STAT           (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART9_CTRL           (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART9_DATA           (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART9_MATCH          (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART9_MODIR          (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART9_FIFO           (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART9_WATER          (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART9_DATARO         (S32K3XX_LPUART9_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART10_VERID         (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART10_PARAM         (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART10_GLOBAL        (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART10_PINCFG        (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART10_BAUD          (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART10_STAT          (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART10_CTRL          (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART10_DATA          (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART10_MATCH         (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART10_MODIR         (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART10_FIFO          (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART10_WATER         (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART10_DATARO        (S32K3XX_LPUART10_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART11_VERID         (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART11_PARAM         (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART11_GLOBAL        (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART11_PINCFG        (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART11_BAUD          (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART11_STAT          (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART11_CTRL          (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART11_DATA          (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART11_MATCH         (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART11_MODIR         (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART11_FIFO          (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART11_WATER         (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART11_DATARO        (S32K3XX_LPUART11_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART12_VERID         (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART12_PARAM         (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART12_GLOBAL        (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART12_PINCFG        (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART12_BAUD          (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART12_STAT          (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART12_CTRL          (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART12_DATA          (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART12_MATCH         (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART12_MODIR         (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART12_FIFO          (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART12_WATER         (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART12_DATARO        (S32K3XX_LPUART12_BASE + S32K3XX_LPUART_DATARO_OFFSET)

