apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_lpuart.h
#define S32K3XX_LPUART13_VERID         (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART13_PARAM         (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART13_GLOBAL        (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART13_PINCFG        (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART13_BAUD          (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART13_STAT          (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART13_CTRL          (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART13_DATA          (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART13_MATCH         (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART13_MODIR         (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART13_FIFO          (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART13_WATER         (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART13_DATARO        (S32K3XX_LPUART13_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART14_VERID         (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART14_PARAM         (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART14_GLOBAL        (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART14_PINCFG        (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART14_BAUD          (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART14_STAT          (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART14_CTRL          (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART14_DATA          (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART14_MATCH         (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART14_MODIR         (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART14_FIFO          (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART14_WATER         (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART14_DATARO        (S32K3XX_LPUART14_BASE + S32K3XX_LPUART_DATARO_OFFSET)

#define S32K3XX_LPUART15_VERID         (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_VERID_OFFSET)
#define S32K3XX_LPUART15_PARAM         (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_PARAM_OFFSET)
#define S32K3XX_LPUART15_GLOBAL        (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_GLOBAL_OFFSET)
#define S32K3XX_LPUART15_PINCFG        (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_PINCFG_OFFSET)
#define S32K3XX_LPUART15_BAUD          (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_BAUD_OFFSET)
#define S32K3XX_LPUART15_STAT          (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_STAT_OFFSET)
#define S32K3XX_LPUART15_CTRL          (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_CTRL_OFFSET)
#define S32K3XX_LPUART15_DATA          (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_DATA_OFFSET)
#define S32K3XX_LPUART15_MATCH         (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_MATCH_OFFSET)
#define S32K3XX_LPUART15_MODIR         (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_MODIR_OFFSET)
#define S32K3XX_LPUART15_FIFO          (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_FIFO_OFFSET)
#define S32K3XX_LPUART15_WATER         (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_WATER_OFFSET)
#define S32K3XX_LPUART15_DATARO        (S32K3XX_LPUART15_BASE + S32K3XX_LPUART_DATARO_OFFSET)

/* Register bit definitions *************************************************/

/* Version ID Register (VERID) */

#define LPUART_VERID_FEATURE_SHIFT     (0)       /* Bits 0-15: Feature Identification Number (FEATURE) */
#define LPUART_VERID_FEATURE_MASK      (0xffff << LPUART_VERID_FEATURE_SHIFT)
#  define LPUART_VERID_FEATURE_STD     (1 << LPUART_VERID_FEATURE_SHIFT) /* Standard feature set */
#  define LPUART_VERID_FEATURE_MODEM   (3 << LPUART_VERID_FEATURE_SHIFT) /* MODEM/IrDA support */

#define LPUART_VERID_MINOR_SHIFT       (16)      /* Bits 16-23: Minor Version Number (MINOR) */
#define LPUART_VERID_MINOR_MASK        (0xff << LPUART_VERID_MINOR_SHIFT)
#define LPUART_VERID_MAJOR_SHIFT       (24)      /* Bits 24-31: Major Version Number (MAJOR) */
#define LPUART_VERID_MAJOR_MASK        (0xff << LPUART_VERID_MAJOR_SHIFT)

/* Parameter Register (PARAM) */

#define LPUART_PARAM_TXFIFO_SHIFT      (0)       /* Bits 0-7: Transmit FIFO Size (TXFIFO) */
#define LPUART_PARAM_TXFIFO_MASK       (0xff << LPUART_PARAM_TXFIFO_SHIFT)
#define LPUART_PARAM_RXFIFO_SHIFT      (8)       /* Bits 8-15: Receive FIFO Size (RXFIFO) */
#define LPUART_PARAM_RXFIFO_MASK       (0xff << LPUART_PARAM_RXFIFO_SHIFT)
                                                 /* Bits 16-31: Reserved */

/* LPUART Global Register (GLOBAL) */

                                                 /* Bit 0: Reserved */
#define LPUART_GLOBAL_RST              (1 << 1)  /* Bit 1: Software Reset (RST) */
                                                 /* Bits 2-31: Reserved */

/* LPUART Pin Configuration Register (PINCFG) */

#define LPUART_PINCFG_TRGSEL_SHIFT     (0)       /* Bits 0-1: Trigger Select (TRGSEL) */
#define LPUART_PINCFG_TRGSEL_MASK      (0x03 << LPUART_PINCFG_TRGSEL_SHIFT)
#  define LPUART_PINCFG_TRGSEL_DISABLE (0 << LPUART_PINCFG_TRGSEL_SHIFT) /* Trigger disabled */
#  define LPUART_PINCFG_TRGSEL_RXD     (1 << LPUART_PINCFG_TRGSEL_SHIFT) /* Trigger used instead of RXD pin */
#  define LPUART_PINCFG_TRGSEL_CTSB    (2 << LPUART_PINCFG_TRGSEL_SHIFT) /* Trigger used instead of CTS_B pin */
#  define LPUART_PINCFG_TRGSEL_TXDMOD  (3 << LPUART_PINCFG_TRGSEL_SHIFT) /* Trigger used to modulate the TXD output */

                                                 /* Bits 2-31: Reserved */

/* LPUART Baud Rate Register (BAUD) */

#define LPUART_BAUD_SBR_SHIFT          (0)       /* Bits 0-12: Baud Rate Modulo Divisor (SBR) */
#define LPUART_BAUD_SBR_MASK           (0x1fff << LPUART_BAUD_SBR_SHIFT)
#  define LPUART_BAUD_SBR(n)           ((n) << LPUART_BAUD_SBR_SHIFT)
#define LPUART_BAUD_SBNS               (1 << 13) /* Bit 13: Stop Bit Number Select (SBNS) */
#define LPUART_BAUD_RXEDGIE            (1 << 14) /* Bit 14: RX Input Active Edge Interrupt Enable (RXEDGIE) */
#define LPUART_BAUD_LBKDIE             (1 << 15) /* Bit 15: LIN Break Detect Interrupt Enable (LBKDIE) */
#define LPUART_BAUD_RESYNCDIS          (1 << 16) /* Bit 16: Resynchronization Disable (RESYNCDIS) */
#define LPUART_BAUD_BOTHEDGE           (1 << 17) /* Bit 17: Both Edge Sampling (BOTHEDGE) */
#define LPUART_BAUD_MATCFG_SHIFT       (18)      /* Bits 18-19: Match Configuration (MATCFG) */
#define LPUART_BAUD_MATCFG_MASK        (0x03 << LPUART_BAUD_MATCFG_SHIFT)
#  define LPUART_BAUD_MATCFG_ADDR      (0 << LPUART_BAUD_MATCFG_SHIFT) /* Address Match Wakeup */
#  define LPUART_BAUD_MATCFG_IDLE      (1 << LPUART_BAUD_MATCFG_SHIFT) /* Idle Match Wakeup */
#  define LPUART_BAUD_MATCFG_ONOFF     (2 << LPUART_BAUD_MATCFG_SHIFT) /* Match On and Match Off */
#  define LPUART_BAUD_MATCFG_RWUENAB   (3 << LPUART_BAUD_MATCFG_SHIFT) /* Enables RWU on Data Match and Match On/Off for transmitter CTS input */

                                                 /* Bit 20: Reserved */
#define LPUART_BAUD_RDMAE              (1 << 21) /* Bit 21: Receiver Full DMA Enable (RDMAE) */
                                                 /* Bit 22: Reserved */
#define LPUART_BAUD_TDMAE              (1 << 23) /* Bit 23: Transmitter DMA Enable (TDMAE) */
#define LPUART_BAUD_OSR_SHIFT          (24)      /* Bits 24-28: Oversampling Ratio (OSR) */
#define LPUART_BAUD_OSR_MASK           (0x0f << LPUART_BAUD_OSR_SHIFT)
#  define LPUART_BAUD_OSR(n)           (((n) - 1) << LPUART_BAUD_OSR_SHIFT) /* n=4..32 */

